content/uses/_index.md
+++
title = "Uses"
author = ["Rudra Kar"]
layout = "single"
draft = false
+++

In my everyday tasks, I rely on a variety of tools to get things
done. While some may not be universally regarded as the best, they’ve
proven to be effective for me. Ultimately, what matters most is
finding the tools that suit your own needs and preferences.


## Software {#software}

**Emacs** – While it might not be the ideal tool for everyone, I find
Emacs to be a fascinating and interactive platform for
experimentation. Throughout my career, I’ve used other editors like
Eclipse, Sublime Text, Atom, and VS Code before transitioning to
Vim. After a few years with Vim, I eventually settled on Emacs. Since
then, I’ve customized my own Emacs [distribution](https://emacs.rudra.dev) and have become quite
comfortable using it.

**Zed** – A great alternative to Sublime Text, Zed is simple and works
well for editing really large files, which Emacs struggles with.

**WezTerm** – I started using WezTerm after it trended on [Hacker
News](https://news.ycombinator.com/item?id=41223934). It’s intuitive and highly configurable, quickly replacing
iTerm as my daily driver.

**Safari** – Yes, Safari is my primary browser. I find it to be a
straightforward, no-nonsense browser that gets the job done. I’ve
tried Firefox, Chrome, and Brave, but I prefer Safari for its
simplicity. Also, owning an iPhone makes it easier to sync bookmarks
and passwords—I'm deeply integrated into the Apple ecosystem.

**Org-Roam** – After using [Logseq](https://logseq.com) and [Notion](https://notion.so) for a while, I settled on
Org-Roam for my note-taking needs. It’s a simple and effective tool
that integrates well with my Emacs workflow.

**Zsh** – I’ve been using Zsh for the past 8 years, and it continues to
serve me well.

**Httpie** – [Httpie](https://httpie.io/desktop) desktop is another clean, effective application I
use for testing APIs. It’s a great alternative to the often cumbersome
Postman.


## Hardware {#hardware}

**Personal computer** – I have a 14" M3 Pro MacBook Pro (2023 model)
that I use for personal projects and browsing. It’s lightweight,
portable, and easy to carry around.

**Work computer** – I use a 16" M2 MacBook Max (2023 model) provided by
my company. It’s a powerhouse—I typically run multiple VMs and K3s
clusters simultaneously, and it handles them effortlessly.

**Fun computer** – I also have a desktop PC with a Ryzen 5600x processor
and an Nvidia 3070 graphics card. It’s primarily used for gaming ~~and
productivity.~~

**Steam Deck OLED** - I got the Steam Deck OLED last december (2023) and
since then, it has been my primary gaming device. I love that I could
play my most favorite games from the convenience of my bed.

**Headphones** – I use SteelSeries Arctis 7 headphones for both work and
gaming. They’re comfortable, especially with aftermarket ear cushions,
and offer decent sound quality. I love the wireless functionality and
how easily they switch between devices.

**Keyboard** – I have a [collection](/keyboards) of keyboards that I rotate through
every few days.

**Mouse** – I use the Logitech G Pro Light Wireless mouse. It’s
extremely lightweight, has an excellent sensor, and has been reliable
for the past couple of years.

**Phone** – I was previously an Android user, but I was pleasantly
surprised when my wife gifted me an iPhone 14. The camera quality is
particularly impressive.

**Camera** – I own a Nikon D3500 with the default lenses it came
with. This was another thoughtful gift from my wife, and I mainly use
it to take photos of my keyboards.


## Ancient History {#ancient-history}

~~**iTerm** – On my MacBook, iTerm was my go-to terminal emulator. Its
compatibility with tmux greatly enhanced my productivity.~~

~~**Brave** – I used to rely on Brave, particularly because Firefox had
issues with certain applications like Google Meet and Team. Brave’s
ability to sync settings across devices helped me overcome this
limitation.~~

~~**Logseq** – I briefly switched to Logseq, primarily for its seamless
synchronization across devices, especially my phone, which led me to
move away from org-mode.~~

~~**Notion** – I was a huge fan of Notion’s database feature, where I
tracked my keyboard inventory, job listings, quick notes, and more.~~
